---
kind: property
id: P:Autodesk.Revit.DB.TextNoteOptions.KeepRotatedTextReadable
source: html/22072662-c584-bf0b-94ad-8e1f92cfe39f.htm
---
# Autodesk.Revit.DB.TextNoteOptions.KeepRotatedTextReadable Property

Flag controling whether a rotate text is to stay oriented to be always readable.

## Syntax (C#)
```csharp
public bool KeepRotatedTextReadable { get; set; }
```

## Remarks
Default value is True.